ahtn/keyplus/efm8/efm8/mcu/C8051F388/inc/SI_C8051F388_Defs.h
// TCON (Timer 0/1 Control)
#define SFR_TCON 0x88
SBIT (TCON_IT0, SFR_TCON, 0); ///< Interrupt 0 Type Select
SBIT (TCON_IE0, SFR_TCON, 1); ///< External Interrupt 0   
SBIT (TCON_IT1, SFR_TCON, 2); ///< Interrupt 1 Type Select
SBIT (TCON_IE1, SFR_TCON, 3); ///< External Interrupt 1   
SBIT (TCON_TR0, SFR_TCON, 4); ///< Timer 0 Run Control    
SBIT (TCON_TF0, SFR_TCON, 5); ///< Timer 0 Overflow Flag  
SBIT (TCON_TR1, SFR_TCON, 6); ///< Timer 1 Run Control    
SBIT (TCON_TF1, SFR_TCON, 7); ///< Timer 1 Overflow Flag  

// TMR2CN (Timer 2 Control)
#define SFR_TMR2CN 0xC8
SBIT (TMR2CN_T2XCLK,  SFR_TMR2CN, 0); ///< Timer 2 External Clock Select    
SBIT (TMR2CN_T2CSS,   SFR_TMR2CN, 1); ///< Timer 2 Capture Source Select    
SBIT (TMR2CN_TR2,     SFR_TMR2CN, 2); ///< Timer 2 Run Control              
SBIT (TMR2CN_T2SPLIT, SFR_TMR2CN, 3); ///< Timer 2 Split Mode Enable        
SBIT (TMR2CN_TF2CEN,  SFR_TMR2CN, 4); ///< Timer 2 Capture Enable           
SBIT (TMR2CN_TF2LEN,  SFR_TMR2CN, 5); ///< Timer 2 Low Byte Interrupt Enable
SBIT (TMR2CN_TF2L,    SFR_TMR2CN, 6); ///< Timer 2 Low Byte Overflow Flag   
SBIT (TMR2CN_TF2H,    SFR_TMR2CN, 7); ///< Timer 2 High Byte Overflow Flag  

// TMR5CN (Timer 5 Control)
#define SFR_TMR5CN 0xC8
SBIT (TMR5CN_T5XCLK,  SFR_TMR5CN, 0); ///< Timer 5 External Clock Select    
SBIT (TMR5CN_TR5,     SFR_TMR5CN, 2); ///< Timer 5 Run Control              
SBIT (TMR5CN_T5SPLIT, SFR_TMR5CN, 3); ///< Timer 5 Split Mode Enable        
SBIT (TMR5CN_TF5LEN,  SFR_TMR5CN, 5); ///< Timer 5 Low Byte Interrupt Enable
SBIT (TMR5CN_TF5L,    SFR_TMR5CN, 6); ///< Timer 5 Low Byte Overflow Flag   
SBIT (TMR5CN_TF5H,    SFR_TMR5CN, 7); ///< Timer 5 High Byte Overflow Flag  

//------------------------------------------------------------------------------
// Interrupt Definitions
//------------------------------------------------------------------------------
#define INT0_IRQn    0  ///< External Interrupt 0  
#define TIMER0_IRQn  1  ///< Timer 0 Overflow      
#define INT1_IRQn    2  ///< External Interrupt 1  
#define TIMER1_IRQn  3  ///< Timer 1 Overflow      
#define UART0_IRQn   4  ///< UART 0                
#define TIMER2_IRQn  5  ///< Timer 2 Overflow      
#define SPI0_IRQn    6  ///< SPI0                  
#define SMBUS0_IRQn  7  ///< SMBus 0               
#define ADC0WC_IRQn  9  ///< ADC0 Window Compare   
#define ADC0EOC_IRQn 10 ///< ADC0 End of Conversion
#define PCA0_IRQn    11 ///< PCA0                  
#define CMP0_IRQn    12 ///< Comparator 0          
#define CMP1_IRQn    13 ///< Comparator 1          
#define TIMER3_IRQn  14 ///< Timer 3 Overflow      
#define INT2LVL_IRQn 15 ///< INT2 Level            
#define UART1_IRQn   16 ///< UART 1                
#define SMBUS1_IRQn  18 ///< SMBus 1               
#define TIMER4_IRQn  19 ///< Timer 4 Overflow      
#define TIMER5_IRQn  20 ///< Timer 5 Overflow      

//------------------------------------------------------------------------------
// SFR Page Definitions
//------------------------------------------------------------------------------
#define LEGACY_PAGE 0x00 ///< Legacy SFR Page                   
#define CONFIG_PAGE 0x0F ///< System and Port Configuration Page
#define SMBUS1_PAGE 0x0F ///< SMBus 1 Page                      

//-----------------------------------------------------------------------------
// SDCC PDATA External Memory Paging Support
//-----------------------------------------------------------------------------

#if defined SDCC

SFR(_XPAGE, 0xAA); // Point to the EMI0CN register

#endif

#endif // SI_C8051F388_DEFS_H
//-eof--------------------------------------------------------------------------

